Repository: drupalprojects/contemplate
Catalog: po/*.po
Languages: de

source: <p>The Content Template (a.k.a. contemplate) module allows modification of the teaser and body fields using administrator defined templates. These templates use PHP code and all of the node object variables are available for use in the template. An example node object is displayed and it is as simple as clicking on its properties to add them to the current template.</p> <p>This module was written to solve a need with the Content Construction Kit (CCK), where it had a tendency toward outputting content in a not-very-pretty way. And as such, it dovetails nicely with CCK, adding a "template" tab to CCK content-type editing pages and pre-populating the templates with CCK's default layout. This makes it easy to rearrange fields, output different fields for teaser and body, remove the field title headers, output fields wrapped for use with tabs.module (part of JSTools), or anything you need.</p> <p>But Content Template can actually be used on any content type and allows modification of the teaser and body properties before they go out in an RSS feed or are handed off to the theme.</p>
de: <p>Das Content-Vorlagen (aka: contemplate) Modul ermöglicht die Veränderung von Anlesetext (<em>Teaser</em>) und Artikeltext mit vom Verwalter erstellten Vorlagen. Diese Vorlagen verwenden PHP Code und alle Variablen von Node-Objekten. Ein Beispiel eines solchen Objekts wird angezeigt und Einträge können einfach durch Klicken auf die Liste der Eigenschaften hinzugefügt werden.</p> <p>Dieses Modul wurde für die Benutzung des Content Construction Kit (CCK) geschrieben, da dieser Inhalte in nicht sehr netter Art ausgibt. Deshalb fügt sich dieses Modul nahtlos an den CCK, in dem ein neuer Reiter "Vorlagen" in Formulare des CCK angezeigt wird. Vorlagen werden mit den Standard-Elementen des CCK erstellt. Dadurch ist es einfach, Felder neu anzuordnen, andere Fleder als Anlese- oder Artikeltext auszugeben, Feld-Bezeichnungen zu entfernen, Felder für die Verwendung mit dem <em>tabs-modul</em> (Teil der JSTools) zu formatieren, oder was immer sonst erforderlich scheint.</p> </p>Content-Vorlagen kann für jeden Inhalts-Typ verwendet werden und ermöglicht die Veränderung von Anlese- und Artikeltext bevor diese durch einen RSS Feed versendet oder mit einem Theme dargestellt werden.

source: Content Templates: Create templates to customize teaser and body content.
de: Content Vorlagen: erstellt Vorlagen zur Anpassung des Anlese- und Artikeltexts.

source: templates
de: Vorlagen

source: template
de: Vorlage

source: edit template
de: Vorlage bearbeiten

source: create template
de: Vorlage erstellen

source: content type
de: Inhalts-Typ

source: template for %type
de: Vorlage für %type

source: Teaser Template
de: Vorlage für Anlesetext

source: <p>An example node has been loaded and it's properties appear below. Click on the the property names to add them to your template.</p>
de: <p>Ein Beipiel-Inhalt wurde geladen und dessen Attribute sind unten angezeigt. Durch Klicken auf einem Attribut wird dieses der Vorlage hinzu gefügt.</p>

source: Body Template
de: Vorlage für Artikeltext

source: Reset
de: Zurücksetzen

source: Are you sure you want to reset this form?\nAny customizations will be lost.
de: Soll das Formular wirklich zurückgesetzt werden?\nAlle Veränderungen gehen damit verloren.

source: %type template has been reset.
de: Vorlage für %type wurde zurückgesetzt.

source: %type template saved.
de: Vorlage für %type wurde gespeichert.

source: No %type content items exist to use as an example. Please create a %type item and then come back here to see an output of its parts.
de: Es sind keine Inhalte vom Typ %type, die als Beispiel genutzt werden könnten. Contemplate kann erst benutzt werden, wenn ein Inhalt vom Typ %type erstellt wurde.
